OpenEPaperLink/Tag_FW_EFR32xG22/firmware/oepl_nvm.c
// -----------------------------------------------------------------------------
//                                   Includes
// -----------------------------------------------------------------------------
#include "em_device.h"
#include "em_msc.h"
#include "em_system.h"
#include "oepl_nvm.h"
#include "oepl_hw_abstraction.h"
#include "oepl_flash_driver.h"
#include "oepl_efr32_hwtypes.h"

#include "oepl-proto.h"
#include "nvm3.h"
#include "nvm3_default.h"
#include "btl_interface.h"
#include "btl_interface_storage.h"
#include "md5.h"
#include <stdio.h>
#include "oepl-definitions.h"

// -----------------------------------------------------------------------------
//                              Configuration values
// -----------------------------------------------------------------------------
#ifndef NVM_DEBUG_PRINT
#define NVM_DEBUG_PRINT 1
#endif

#define NVM3_OBJECT_ID_CONFIG               0x0000
#define NVM3_OBJECT_ID_SETTINGS_START       0x0001
#define NVM3_OBJECT_ID_SETTINGS_MAX         0x0100

#define NVM3_OBJECT_ID_FWU_METADATA         0x1000
#define NVM3_OBJECT_ID_FWU_BLOCK_COUNTER    0x1001
#define NVM3_OBJECT_ID_IMAGE_METADATA_BASE  0x2000
#define NVM3_OBJECT_ID_IMAGE_METADATA_MAX   0x2010

#define NVM3_MARKER_VALUE                   0xCAFEFACEUL

// Tags without an external SPI flash keep bulk image storage in internal
// flash, between the end of the app+NVM3 region (linker_nvm_end, the top
// of the linker's FLASH region) and the end of the physical flash. The
// physical size is taken from DEVINFO at runtime, because the part we
// link against (F512) can have more flash than the part on the board
// (the SES-imagotag EL042TS1 carries a 256 kB FG22).
extern char linker_nvm_end;
#define INTERNAL_BULK_STORAGE_BASE          ((uint32_t)&linker_nvm_end)

// -----------------------------------------------------------------------------
//                              Macros and Typedefs
// -----------------------------------------------------------------------------
#if NVM_DEBUG_PRINT
#define DPRINTF(fmt_, ...) oepl_hw_debugprint(DBG_NVM, (fmt_), ##__VA_ARGS__)
#else
#define DPRINTF(...)
#endif

typedef struct {
  uint32_t marker;
  uint8_t hwid;
  size_t fwu_slot_size;
  uint32_t bulk_storage_base_address;
  size_t bulk_storage_size;
  size_t bulk_storage_pagesize;
} device_hw_config_t;

typedef struct {
  uint64_t current_md5;
  uint64_t staged_md5;
  uint16_t current_version;
  uint16_t staged_version;
  size_t current_size;
  size_t staged_size;
} device_fwu_meta_t;

// -----------------------------------------------------------------------------
//                          Static Function Declarations
// -----------------------------------------------------------------------------
static oepl_nvm_status_t check_fwu_md5(void);
static bool bulk_storage_is_internal(void);
static oepl_nvm_status_t internal_storage_erase(uint32_t address, size_t length);
static oepl_nvm_status_t internal_storage_write(uint32_t address, const uint8_t* bytes, size_t length);

// -----------------------------------------------------------------------------
//                                Global Variables
// -----------------------------------------------------------------------------

// -----------------------------------------------------------------------------
//                                Static Variables
// -----------------------------------------------------------------------------
static device_hw_config_t devconfig;
const oepl_stored_tagsettings_t oepl_default_tagsettings = {
  .settingsVer = 1,                  // the version of the struct as written to the infopage
  .enableFastBoot = 0,               // default 0; if set, it will skip splashscreen
  .enableRFWake = 0,                 // default 0; if set, it will enable RF wake. This will add about ~0.9µA idle power consumption
  .enableTagRoaming = 0,             // default 0; if set, the tag will scan for an accesspoint every few check-ins. This will increase power consumption quite a bit
  .enableScanForAPAfterTimeout = 1,  // default 1; if a the tag failed to check in, after a few attempts it will try to find a an AP on other channels
  .enableLowBatSymbol = 1,           // default 1; tag will show 'low battery' icon on screen if the battery is depleted
  .enableNoRFSymbol = 1,             // default 1; tag will show 'no signal' icon on screen if it failed to check in for a longer period of time
  .fastBootCapabilities = 0,         // holds the byte with 'capabilities' as detected during a normal tag boot; allows the tag to skip detecting buttons and NFC chip
  .customMode = 0,                   // default 0; if anything else, tag will bootup in a different 'mode'
  .batLowVoltage = 2600,               // Low battery threshold voltage (2450 for 2.45v). defaults to BATTERY_VOLTAGE_MINIMUM from powermgt.h
  .minimumCheckInTime = 40,          // defaults to BASE_INTERVAL from powermgt.h
  .fixedChannel = 0,                 // default 0; if set to a valid channel number, the tag will stick to that channel
};

static oepl_stored_tagsettings_t tag_settings;

// -----------------------------------------------------------------------------
//                          Public Function Definitions
// -----------------------------------------------------------------------------

// ------------------------ Base NVM Layer functionality -----------------------
oepl_nvm_status_t oepl_nvm_init_default(void)
{
  // Bugfix: deinit the bootloader explicitly since it might not have realized
  bootloader_deinit();
  Ecode_t nvm_status = nvm3_readData(nvm3_defaultHandle, NVM3_OBJECT_ID_CONFIG, &devconfig, sizeof(devconfig));
  if(nvm_status == ECODE_NVM3_ERR_NOT_OPENED) {
    // The nvm3_initDefault() call in sl_platform_init() failed and its return
    // code was discarded. It runs right after bootloader_init(), which can
    // interfere with flash access; now that the bootloader is deinited, retry
    // the open and log the original failure reason if it persists.
    nvm_status = nvm3_initDefault();
    DPRINTF("NVM3 was not open at boot; reopen attempt returned %08lX\n", nvm_status);
    if(nvm_status == ECODE_NVM3_ERR_NO_VALID_PAGES) {
      // The NVM3 area contains non-NVM3 data, e.g. remnants of a previous
      // firmware with a different flash layout. Erase the area and retry.
      DPRINTF("Erasing NVM3 area at %p (%d bytes) and retrying\n",
              nvm3_defaultInit->nvmAdr, nvm3_defaultInit->nvmSize);
      if(internal_storage_erase((uint32_t)nvm3_defaultInit->nvmAdr, nvm3_defaultInit->nvmSize) == NVM_SUCCESS) {
        nvm_status = nvm3_initDefault();
        DPRINTF("NVM3 open after erase returned %08lX\n", nvm_status);
      }
    }
    if(nvm_status == ECODE_OK) {
      nvm_status = nvm3_readData(nvm3_defaultHandle, NVM3_OBJECT_ID_CONFIG, &devconfig, sizeof(devconfig));
    }
  }
  if(nvm_status != ECODE_OK) {
    DPRINTF("Unable to read/find device initial settings, %08lX\n", nvm_status);
    return NVM_ERROR;
  }
  if(devconfig.marker != NVM3_MARKER_VALUE) {
    DPRINTF("Wrong version of device initial settings\n");
    return NVM_ERROR;
  }
  if(devconfig.bulk_storage_size < 4096) {
    DPRINTF("No flash registered, rerunning autodetect\n");
    nvm3_deleteObject(nvm3_defaultHandle, NVM3_OBJECT_ID_CONFIG);
    return NVM_ERROR;
  }

