OpenEPaperLink/Tag_FW_EFR32xG22/firmware/oepl_nvm.c
  return NVM_SUCCESS;
}

static bool bulk_storage_is_internal(void)
{
  const oepl_efr32xg22_tagconfig_t* tagcfg = oepl_efr32xg22_get_config();
  return tagcfg == NULL
         || tagcfg->flash == NULL
         || tagcfg->flash->nCS.port == gpioPortInvalid;
}

static oepl_nvm_status_t internal_storage_erase(uint32_t address, size_t length)
{
  MSC_Init();
  for(uint32_t page = address; page < address + length; page += FLASH_PAGE_SIZE) {
    if(MSC_ErasePage((uint32_t*)page) != mscReturnOk) {
      MSC_Deinit();
      DPRINTF("Internal flash erase failed at 0x%08lx\n", page);
      return NVM_ERROR;
    }
  }
  MSC_Deinit();
  return NVM_SUCCESS;
}

static oepl_nvm_status_t internal_storage_write(uint32_t address, const uint8_t* bytes, size_t length)
{
  MSC_Status_TypeDef status;
  // Image block offsets are 4k-aligned, so the address is always
  // word-aligned. The length of the last block of an image may not be:
  // pad the tail out to a full word with erased-state bytes.
  size_t aligned_length = length & ~3UL;
  MSC_Init();
  status = MSC_WriteWord((uint32_t*)address, bytes, aligned_length);
  if(status == mscReturnOk && aligned_length < length) {
    uint8_t tail[4] = {0xFF, 0xFF, 0xFF, 0xFF};
    memcpy(tail, &bytes[aligned_length], length - aligned_length);
    status = MSC_WriteWord((uint32_t*)(address + aligned_length), tail, sizeof(tail));
  }
  MSC_Deinit();
  if(status != mscReturnOk) {
    DPRINTF("Internal flash write failed at 0x%08lx (%d)\n", address, status);
    return NVM_ERROR;
  }
  return NVM_SUCCESS;
}

oepl_nvm_status_t oepl_nvm_factory_reset(uint8_t hwid)
{
  oepl_nvm_status_t function_status = NVM_ERROR;
  Ecode_t nvm_status = nvm3_eraseAll(nvm3_defaultHandle);
  if(nvm_status != ECODE_OK) {
    DPRINTF("Failed resetting to factory, %08lX\n", nvm_status);
    return NVM_ERROR;
  }

  devconfig.marker = NVM3_MARKER_VALUE;
  devconfig.hwid = hwid;

  if(bulk_storage_is_internal()) {
    // No external flash on this tag: bulk image storage lives in the top
    // region of internal flash instead of a bootloader-managed SPI flash.
    // There is no FWU staging slot in this mode (flash via SWD instead).
    uint32_t flash_size = (uint32_t)SYSTEM_GetFlashSize() * 1024UL;
    if(flash_size <= INTERNAL_BULK_STORAGE_BASE) {
      DPRINTF("Internal flash (%ldB) too small for bulk storage\n", flash_size);
      return NVM_ERROR;
    }
    devconfig.fwu_slot_size = 0;
    devconfig.bulk_storage_base_address = INTERNAL_BULK_STORAGE_BASE;
    devconfig.bulk_storage_size = flash_size - INTERNAL_BULK_STORAGE_BASE;
    devconfig.bulk_storage_pagesize = FLASH_PAGE_SIZE;
    DPRINTF("Using internal bulk storage at 0x%08lx, %ldB in pages of %ldB\n",
            devconfig.bulk_storage_base_address,
            devconfig.bulk_storage_size,
            devconfig.bulk_storage_pagesize);

    function_status = internal_storage_erase(devconfig.bulk_storage_base_address,
                                             devconfig.bulk_storage_size);
    if(function_status != NVM_SUCCESS) {
      DPRINTF("Failed erasing internal bulk storage\n");
      return function_status;
    }

    nvm3_writeData(nvm3_defaultHandle, NVM3_OBJECT_ID_CONFIG, &devconfig, sizeof(devconfig));
    DPRINTF("Stored new devconfig\n");

    function_status = oepl_nvm_setting_set_default(OEPL_RAW_TAGSETTINGS);
    if(function_status == NVM_SUCCESS) {
      DPRINTF("Stored default tagconfig\n");
    } else {
      DPRINTF("Didn't manage to set tagconfig?\n");
    }
    return function_status;
  }

  // Autodetect FWU and storage size through the bootloader flash driver
  int32_t status;
  BootloaderStorageSlot_t slotInfo;
  BootloaderStorageInformation_t flashInfo;

  oepl_hw_flash_wake();
  if((status = bootloader_init()) != BOOTLOADER_OK)
  {
    DPRINTF("Failed BTL init with %08lx\n", status);
    goto exit;
  }

  bootloader_getStorageInfo(&flashInfo);
  if(flashInfo.numStorageSlots > 1) {
    DPRINTF("Bootloader with multiple slots is not supported (yet)\n");
    status = BOOTLOADER_ERROR_INIT_STORAGE;
    goto done;
  }

  if((status = bootloader_getStorageSlotInfo(0, &slotInfo)) != BOOTLOADER_OK)
  {
    DPRINTF("Failed BTL slot info with %08lx\n", status);
    goto done;
  }

  DPRINTF("Detected bootloader slot size %ldB\n", slotInfo.length);
  DPRINTF("Detected raw flash with size %ldB, page size %ldB\n", flashInfo.flashInfo.partSize, flashInfo.flashInfo.pageSize);
  DPRINTF("Wordsize %d, page erase %ldms, part erase %ldms\n", flashInfo.flashInfo.wordSizeBytes, flashInfo.flashInfo.pageEraseMs, flashInfo.flashInfo.partEraseMs);

  devconfig.fwu_slot_size = slotInfo.length;
  devconfig.bulk_storage_size = flashInfo.flashInfo.partSize - slotInfo.length - slotInfo.address;
  devconfig.bulk_storage_pagesize = flashInfo.flashInfo.pageSize;
  devconfig.bulk_storage_base_address = slotInfo.address + slotInfo.length;

  DPRINTF("Raw flash content before erase:\n");
  for(size_t i = 0; i < flashInfo.flashInfo.partSize / 32; i+=32) {
    uint8_t buffer[32];
    bootloader_readRawStorage(i, buffer, 32);
    for(size_t j = 0; j < 32; j++) {
      DPRINTF("%02x", buffer[j]);
      if(j > 0 && j % 8 == 0) {
        DPRINTF(" ");
      }
    }
    DPRINTF("\n");
  }

  // Erase the storage
  status = bootloader_eraseRawStorage(slotInfo.address, flashInfo.flashInfo.partSize);
  if(status != BOOTLOADER_OK) {
    DPRINTF("Failed flash device erase with %08lx\n", status);
  }

  nvm3_writeData(nvm3_defaultHandle, NVM3_OBJECT_ID_CONFIG, &devconfig, sizeof(devconfig));
  DPRINTF("Stored new devconfig\n");

  function_status = oepl_nvm_setting_set_default(OEPL_RAW_TAGSETTINGS);
  if(function_status == NVM_SUCCESS) {
    DPRINTF("Stored default tagconfig\n");
  } else {
    DPRINTF("Didn't manage to set tagconfig?\n");
  }

done:
  if(status == BOOTLOADER_OK) {
    function_status = NVM_SUCCESS;
  }

  if((status = bootloader_deinit()) != BOOTLOADER_OK)
  {
    DPRINTF("Failed BTL deinit with %08lx\n", status);
    function_status = NVM_ERROR;
  }
exit:
  oepl_hw_flash_deepsleep();
  return function_status;
}

