OpenEPaperLink/Tag_FW_EFR32xG22/firmware/oepl_nvm.c
oepl_nvm_status_t oepl_nvm_setting_set(oepl_setting_entry_t entry, const void* data, size_t length)
{
  Ecode_t status;
  switch(entry) {
    case OEPL_HWID:
      if(length != sizeof(devconfig.hwid)) {
        return NVM_ERROR;
      }
      devconfig.hwid = *(uint8_t*)data;
      status = nvm3_writeData(nvm3_defaultHandle, NVM3_OBJECT_ID_CONFIG, &devconfig, sizeof(devconfig));
      return status == ECODE_NVM3_OK ? NVM_SUCCESS : NVM_ERROR;
    case OEPL_RAW_TAGSETTINGS:
      if(length != sizeof(tag_settings)) {
        return NVM_ERROR;
      }
      memcpy(&tag_settings, data, length);
      break;
    case OEPL_ENABLE_FASTBOOT:
      if(length != sizeof(tag_settings.enableFastBoot)) {
        return NVM_ERROR;
      }
      tag_settings.enableFastBoot = *((uint8_t*)data);
      entry = OEPL_RAW_TAGSETTINGS;
      data = &tag_settings;
      length = sizeof(tag_settings);
      break;
    case OEPL_ENABLE_RFWAKE:
      if(length != sizeof(tag_settings.enableRFWake)) {
        return NVM_ERROR;
      }
      tag_settings.enableRFWake = *((uint8_t*)data);
      entry = OEPL_RAW_TAGSETTINGS;
      data = &tag_settings;
      length = sizeof(tag_settings);
      break;
    case OEPL_ENABLE_TAGROAMING:
      if(length != sizeof(tag_settings.enableTagRoaming)) {
        return NVM_ERROR;
      }
      tag_settings.enableTagRoaming = *((uint8_t*)data);
      entry = OEPL_RAW_TAGSETTINGS;
      data = &tag_settings;
      length = sizeof(tag_settings);
      break;
    case OEPL_ENABLE_AUTOSCAN_ON_ORPHAN:
      if(length != sizeof(tag_settings.enableScanForAPAfterTimeout)) {
        return NVM_ERROR;
      }
      tag_settings.enableScanForAPAfterTimeout = *((uint8_t*)data);
      entry = OEPL_RAW_TAGSETTINGS;
      data = &tag_settings;
      length = sizeof(tag_settings);
      break;
    case OEPL_ENABLE_LOWBAT_ICON:
      if(length != sizeof(tag_settings.enableLowBatSymbol)) {
        return NVM_ERROR;
      }
      tag_settings.enableLowBatSymbol = *((uint8_t*)data);
      entry = OEPL_RAW_TAGSETTINGS;
      data = &tag_settings;
      length = sizeof(tag_settings);
      break;
    case OEPL_ENABLE_NORF_ICON:
      if(length != sizeof(tag_settings.enableNoRFSymbol)) {
        return NVM_ERROR;
      }
      tag_settings.enableNoRFSymbol = *((uint8_t*)data);
      entry = OEPL_RAW_TAGSETTINGS;
      data = &tag_settings;
      length = sizeof(tag_settings);
      break;
    case OEPL_STORED_CAPABILITIES:
      if(length != sizeof(tag_settings.fastBootCapabilities)) {
        return NVM_ERROR;
      }
      tag_settings.fastBootCapabilities = *((uint8_t*)data);
      entry = OEPL_RAW_TAGSETTINGS;
      data = &tag_settings;
      length = sizeof(tag_settings);
      break;
    case OEPL_CUSTOM_MODE:
      if(length != sizeof(tag_settings.customMode)) {
        return NVM_ERROR;
      }
      tag_settings.customMode = *((uint8_t*)data);
      entry = OEPL_RAW_TAGSETTINGS;
      data = &tag_settings;
      length = sizeof(tag_settings);
      break;
    case OEPL_LOWBAT_VOLTAGE_MV:
      if(length != sizeof(tag_settings.batLowVoltage)) {
        return NVM_ERROR;
      }
      memcpy(&tag_settings.batLowVoltage, data, sizeof(tag_settings.batLowVoltage));
      entry = OEPL_RAW_TAGSETTINGS;
      data = &tag_settings;
      length = sizeof(tag_settings);
      break;
    case OEPL_MIN_CHECKIN_INTERVAL_S:
      if(length != sizeof(tag_settings.minimumCheckInTime)) {
        return NVM_ERROR;
      }
      memcpy(&tag_settings.minimumCheckInTime, data, sizeof(tag_settings.minimumCheckInTime));
      entry = OEPL_RAW_TAGSETTINGS;
      data = &tag_settings;
      length = sizeof(tag_settings);
      break;
    case OEPL_FIXED_CHANNEL:
      if(length != sizeof(tag_settings.fixedChannel)) {
        return NVM_ERROR;
      }
      tag_settings.fixedChannel = *((uint8_t*)data);
      entry = OEPL_RAW_TAGSETTINGS;
      data = &tag_settings;
      length = sizeof(tag_settings);
      break;
    default:
     // No special handling needed
      break;
  }

  status = nvm3_writeData(nvm3_defaultHandle, NVM3_OBJECT_ID_SETTINGS_START + (size_t)entry, data, length);
  if(status == ECODE_NVM3_OK) {
    return NVM_SUCCESS;
  } else {
    return NVM_ERROR;
  }
}

oepl_nvm_status_t oepl_nvm_setting_get(oepl_setting_entry_t entry, void* data, size_t length)
{
  switch(entry) {
    case OEPL_HWID:
      if(length < sizeof(devconfig.hwid)) {
        return NVM_ERROR;
      }
      *(uint8_t*)data = devconfig.hwid;
      return NVM_SUCCESS;
    case OEPL_ENABLE_FASTBOOT:
      if(length < sizeof(tag_settings.enableFastBoot)) {
        return NVM_ERROR;
      }
      *(uint8_t*)data = tag_settings.enableFastBoot;
      return NVM_SUCCESS;
    case OEPL_ENABLE_RFWAKE:
      if(length < sizeof(tag_settings.enableRFWake)) {
        return NVM_ERROR;
      }
      *(uint8_t*)data = tag_settings.enableRFWake;
      return NVM_SUCCESS;
    case OEPL_ENABLE_TAGROAMING:
      if(length < sizeof(tag_settings.enableTagRoaming)) {
        return NVM_ERROR;
      }
      *(uint8_t*)data = tag_settings.enableTagRoaming;
      return NVM_SUCCESS;
    case OEPL_ENABLE_AUTOSCAN_ON_ORPHAN:
      if(length < sizeof(tag_settings.enableScanForAPAfterTimeout)) {
        return NVM_ERROR;
      }
      *(uint8_t*)data = tag_settings.enableScanForAPAfterTimeout;
      return NVM_SUCCESS;
    case OEPL_ENABLE_LOWBAT_ICON:
      if(length < sizeof(tag_settings.enableLowBatSymbol)) {
        return NVM_ERROR;
      }
      *(uint8_t*)data = tag_settings.enableLowBatSymbol;
      return NVM_SUCCESS;
    case OEPL_ENABLE_NORF_ICON:
      if(length < sizeof(tag_settings.enableNoRFSymbol)) {
        return NVM_ERROR;
      }
      *(uint8_t*)data = tag_settings.enableNoRFSymbol;
      return NVM_SUCCESS;
    case OEPL_STORED_CAPABILITIES:
      if(length < sizeof(tag_settings.fastBootCapabilities)) {
        return NVM_ERROR;
      }
      *(uint8_t*)data = tag_settings.fastBootCapabilities;
      return NVM_SUCCESS;
    case OEPL_CUSTOM_MODE:
      if(length < sizeof(tag_settings.customMode)) {
        return NVM_ERROR;
      }
      *(uint8_t*)data = tag_settings.customMode;
      return NVM_SUCCESS;
    case OEPL_LOWBAT_VOLTAGE_MV:
      if(length < sizeof(tag_settings.batLowVoltage)) {
        return NVM_ERROR;
      }
      memcpy(data, &tag_settings.batLowVoltage, sizeof(tag_settings.batLowVoltage));
      return NVM_SUCCESS;
    case OEPL_MIN_CHECKIN_INTERVAL_S:
      if(length < sizeof(tag_settings.minimumCheckInTime)) {
        return NVM_ERROR;
      }
      memcpy(data, &tag_settings.minimumCheckInTime, sizeof(tag_settings.minimumCheckInTime));
      return NVM_SUCCESS;
    case OEPL_FIXED_CHANNEL:
      if(length < sizeof(tag_settings.fixedChannel)) {
        return NVM_ERROR;
      }
      *(uint8_t*)data = tag_settings.fixedChannel;
      return NVM_SUCCESS;
    default:
      break;
  }

  Ecode_t status = nvm3_readData(nvm3_defaultHandle, NVM3_OBJECT_ID_SETTINGS_START + (size_t)entry, data, length);
  if(status == ECODE_NVM3_OK) {
    return NVM_SUCCESS;
  } else if(status == ECODE_NVM3_ERR_KEY_NOT_FOUND) {
    return NVM_NOT_FOUND;
  } else {
    return NVM_ERROR;
  }
}

oepl_nvm_status_t oepl_nvm_setting_delete(oepl_setting_entry_t entry)
{
  switch(entry) {
    case OEPL_ENABLE_FASTBOOT:
      // Fallthrough
    case OEPL_ENABLE_RFWAKE:
      // Fallthrough
    case OEPL_ENABLE_TAGROAMING:
      // Fallthrough
    case OEPL_ENABLE_AUTOSCAN_ON_ORPHAN:
      // Fallthrough
    case OEPL_ENABLE_LOWBAT_ICON:
      // Fallthrough
    case OEPL_ENABLE_NORF_ICON:
      // Fallthrough
    case OEPL_STORED_CAPABILITIES:
      // Fallthrough
    case OEPL_CUSTOM_MODE:
      // Fallthrough
    case OEPL_LOWBAT_VOLTAGE_MV:
      // Fallthrough
    case OEPL_MIN_CHECKIN_INTERVAL_S:
      // Fallthrough
    case OEPL_FIXED_CHANNEL:
      // Cannot remove members of the tag settings struct
      return NVM_NOT_SUPPORTED;
    default:
      break;
  }

  Ecode_t status = nvm3_deleteObject(nvm3_defaultHandle, NVM3_OBJECT_ID_SETTINGS_START + (size_t)entry);
  if(status == ECODE_NVM3_OK || status == ECODE_NVM3_ERR_KEY_NOT_FOUND) {
    return NVM_SUCCESS;
  } else {
    return NVM_ERROR;
  }
}

oepl_nvm_status_t oepl_nvm_setting_set_default(oepl_setting_entry_t entry)
{
  if(entry != OEPL_RAW_TAGSETTINGS) {
    return NVM_NOT_SUPPORTED;
  }

