OpenEPaperLink/Tag_FW_EFR32xG22/firmware/oepl_nvm.c
oepl_nvm_status_t oepl_nvm_erase_image(size_t img_idx)
{
  DPRINTF("Erasing image at idx 0x%x\n", img_idx);
  size_t num_slots, slot_size;
  oepl_nvm_status_t retval = oepl_nvm_get_num_img_slots(&num_slots, &slot_size);
  if(retval != NVM_SUCCESS) {
    return retval;
  }

  if(img_idx >= num_slots) {
    return NVM_NOT_SUPPORTED;
  }

  // Erase the slot in bulk storage first
  if(bulk_storage_is_internal()) {
    retval = internal_storage_erase(devconfig.bulk_storage_base_address + img_idx * slot_size, slot_size);
    if(retval != NVM_SUCCESS) {
      return retval;
    }
  } else {
    int32_t btl_status;
    oepl_hw_flash_wake();
    if((btl_status = bootloader_init()) != BOOTLOADER_OK) {
      DPRINTF("Failed BTL init with %08lx\n", btl_status);
      oepl_hw_flash_deepsleep();
      return NVM_ERROR;
    }

    btl_status = bootloader_eraseRawStorage(devconfig.bulk_storage_base_address + img_idx * slot_size, slot_size);
    bootloader_deinit();
    oepl_hw_flash_deepsleep();
    if(btl_status != BOOTLOADER_OK) {
      return NVM_ERROR;
    }
  }

  // Then erase the accompanying metadata
  Ecode_t nvm_status = nvm3_deleteObject(nvm3_defaultHandle, NVM3_OBJECT_ID_IMAGE_METADATA_BASE + img_idx);
  if(nvm_status == ECODE_NVM3_OK ||
     nvm_status == ECODE_NVM3_ERR_KEY_NOT_FOUND) {
    return NVM_SUCCESS;
  } else {
    return NVM_ERROR;
  }
}

oepl_nvm_status_t oepl_nvm_erase_image_cache(uint8_t image_type)
{
  DPRINTF("Erasing cached images of type 0x%x\n", image_type);
  size_t highest_idx, highest_seqno;

  oepl_nvm_status_t retval = oepl_nvm_get_image_by_type(image_type, &highest_idx, &highest_seqno);
  if(retval == NVM_NOT_FOUND) {
    return NVM_SUCCESS;
  } else if(retval != NVM_SUCCESS) {
    return retval;
  }
  
  size_t num_slots, slot_size;
  retval = oepl_nvm_get_num_img_slots(&num_slots, &slot_size);
  if(retval != NVM_SUCCESS) {
    return retval;
  }

  for(size_t i = 0; i < num_slots; i++) {
    oepl_stored_image_hdr_t imgmeta;
    Ecode_t nvm_status = nvm3_readData(nvm3_defaultHandle, NVM3_OBJECT_ID_IMAGE_METADATA_BASE + i, &imgmeta, sizeof(imgmeta));
    if(nvm_status == ECODE_NVM3_ERR_KEY_NOT_FOUND) {
      continue;
    } else if(nvm_status != ECODE_NVM3_OK) {
      // Hardware / application error?
      return NVM_ERROR;
    } else if (i == highest_idx) {
      continue;
    } else if((imgmeta.image_type == image_type) && (imgmeta.seqno != highest_seqno)) {
      // Clean up and release this slot back for use, as it is not the most recent image
      retval = oepl_nvm_erase_image(i);
      if(retval != NVM_SUCCESS) {
        return retval;
      }
    }
  }

  return NVM_SUCCESS;
}

oepl_nvm_status_t oepl_nvm_write_image_metadata(size_t img_idx, oepl_stored_image_hdr_t* metadata)
{
  DPRINTF("Writing metadata for image idx 0x%x\n", img_idx);
  size_t num_slots, slot_size;
  oepl_nvm_status_t retval = oepl_nvm_get_num_img_slots(&num_slots, &slot_size);
  if(retval != NVM_SUCCESS) {
    return retval;
  }

  if(img_idx >= num_slots) {
    return NVM_NOT_SUPPORTED;
  }

  uint32_t type;
  size_t len;
  Ecode_t nvm_status = nvm3_getObjectInfo(nvm3_defaultHandle, NVM3_OBJECT_ID_IMAGE_METADATA_BASE + img_idx, &type, &len);

  if(nvm_status == ECODE_NVM3_ERR_KEY_NOT_FOUND) {
    // We're setting a new image. Track sequence number if another one of the same type exists.
    size_t existing_idx, existing_seq;
    if(oepl_nvm_get_image_by_type(metadata->image_type, &existing_idx, &existing_seq) == NVM_SUCCESS) {
      metadata->seqno = existing_seq + 1;
    }
  } else if(nvm_status == ECODE_NVM3_OK) {
    // We're updating or overwriting an existing object. Ensure we keep the sequence number the same.
    oepl_stored_image_hdr_t existing_image;
    retval = oepl_nvm_read_image_metadata(img_idx, &existing_image);
    if(retval != NVM_SUCCESS) {
      return retval;
    }
    if(metadata->md5 == existing_image.md5 && metadata->size == existing_image.size) {
      metadata->seqno = existing_image.seqno;
    }
  } else {
    // Hardware / application error?
    return NVM_ERROR;
  }

  nvm_status = nvm3_writeData(nvm3_defaultHandle, NVM3_OBJECT_ID_IMAGE_METADATA_BASE + img_idx, metadata, sizeof(oepl_stored_image_hdr_t));

  return nvm_status == ECODE_NVM3_OK ? NVM_SUCCESS : NVM_ERROR;
}

oepl_nvm_status_t oepl_nvm_read_image_metadata(size_t img_idx, oepl_stored_image_hdr_t* metadata)
{
  DPRINTF("Requesting metadata for image at idx 0x%x\n", img_idx);
  size_t num_slots, slot_size;
  oepl_nvm_status_t retval = oepl_nvm_get_num_img_slots(&num_slots, &slot_size);
  if(retval != NVM_SUCCESS) {
    return retval;
  }

  if(img_idx >= num_slots) {
    return NVM_NOT_SUPPORTED;
  }

  Ecode_t nvm_status = nvm3_readData(nvm3_defaultHandle, NVM3_OBJECT_ID_IMAGE_METADATA_BASE + img_idx, metadata, sizeof(oepl_stored_image_hdr_t));

  return nvm_status == ECODE_NVM3_OK ? NVM_SUCCESS : NVM_ERROR;
}

oepl_nvm_status_t oepl_nvm_write_image_bytes(size_t img_idx, size_t offset, const uint8_t* bytes, size_t length)
{
  size_t num_slots, slot_size;
  oepl_nvm_status_t retval = oepl_nvm_get_num_img_slots(&num_slots, &slot_size);
  if(retval != NVM_SUCCESS) {
    return retval;
  }

  if(img_idx >= num_slots) {
    return NVM_NOT_SUPPORTED;
  }

  DPRINTF("Write %d to addr 0x%08x\n", length, devconfig.bulk_storage_base_address + img_idx * slot_size + offset);

  if(bulk_storage_is_internal()) {
    return internal_storage_write(devconfig.bulk_storage_base_address + img_idx * slot_size + offset, bytes, length);
  }

  int32_t btl_status;
  oepl_hw_flash_wake();
  if((btl_status = bootloader_init()) != BOOTLOADER_OK) {
    DPRINTF("Failed BTL init with %08lx\n", btl_status);
    goto exit;
  }

  // Todo: does the bootloader really modify its input byte buffer?
  btl_status = bootloader_writeRawStorage(devconfig.bulk_storage_base_address + img_idx * slot_size + offset, (uint8_t*)bytes, length);

  bootloader_deinit();

  exit:
  oepl_hw_flash_deepsleep();
  if(btl_status != BOOTLOADER_OK) {
    return NVM_ERROR;
  } else {
    return retval;
  }
}

oepl_nvm_status_t oepl_nvm_read_image_bytes(size_t img_idx, size_t offset, uint8_t* bytes, size_t length)
{
  size_t num_slots, slot_size;
  oepl_nvm_status_t retval = oepl_nvm_get_num_img_slots(&num_slots, &slot_size);
  if(retval != NVM_SUCCESS) {
    return retval;
  }

  if(img_idx >= num_slots) {
    return NVM_NOT_SUPPORTED;
  }

  if(length == HAL_flashRead(devconfig.bulk_storage_base_address + img_idx * slot_size + offset, bytes, length)) {
    retval = NVM_SUCCESS;
  } else {
    retval = NVM_ERROR;
  }

  return retval;
}

