OpenEPaperLink/Tag_FW_EFR32xG22/firmware/oepl_nvm.c
// -----------------------------------------------------------------------------
//                          Static Function Definitions
// -----------------------------------------------------------------------------
// Split this in a separate subroutine as the call stack blows up otherwise
static oepl_nvm_status_t check_fwu_md5(void)
{
  uint8_t read_buffer[512];
  size_t offset;
  MD5Context md5;
  device_fwu_meta_t meta;
  oepl_nvm_status_t retval = NVM_SUCCESS;
  Ecode_t status = nvm3_readData(nvm3_defaultHandle, NVM3_OBJECT_ID_FWU_METADATA, &meta, sizeof(meta));
  if(status != ECODE_NVM3_OK) {
    DPRINTF("No staged upgrade found in NVM\n");
    return NVM_ERROR;
  }
  if(meta.staged_version == 0 || meta.staged_size == 0) {
    DPRINTF("No staged upgrade info found\n");
    return NVM_NOT_FOUND;
  }

  oepl_hw_flash_wake();

  size_t read_size = meta.staged_size - 0 > sizeof(read_buffer) ? sizeof(read_buffer) : meta.staged_size - offset;
  DPRINTF("Verifying MD5 on %d bytes in chunks of %d\n", meta.staged_size, read_size);
  md5Init(&md5);
  for(size_t offset = 0; offset < meta.staged_size;) {
    read_size = meta.staged_size - offset > sizeof(read_buffer) ? sizeof(read_buffer) : meta.staged_size - offset;
    if(read_size != HAL_flashRead(offset, read_buffer, read_size)) {
      DPRINTF("Failed FWU read\n");
      retval = NVM_ERROR;
      goto exit;
    }
    md5Update(&md5, read_buffer, read_size);
    offset += read_size;
  }
  md5Finalize(&md5);

  if(memcmp(&md5.digest[0], &meta.staged_md5, sizeof(meta.staged_md5) != 0)) {
    DPRINTF("MD5 failed, got [ ");
    for(size_t i = 0; i < 8; i++) {
      DPRINTF("%02X", md5.digest[i]);
    }
    DPRINTF(" ] expected [ ");
    for(size_t i = 0; i < 8; i++) {
      DPRINTF("%02X", ((uint8_t*)&meta.staged_md5)[i]);
    }
    retval = NVM_NOT_FOUND;
    goto exit;
  }
  exit:
  oepl_hw_flash_deepsleep();
  return retval;
}
